app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all
---
SELECT "disciplines".* FROM "disciplines"

  def create
    @discipline = Discipline.new(discipline_params)

    respond_to do |format|
      if @discipline.save
---
INSERT INTO "disciplines" ("created_at", "name", "semester", "subject", "subject_short", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-13 13:44:23.213007"], ["name", "dsad"], ["semester", "dasdsa"], ["subject", "sad"], ["subject_short", "sadsadsa"], ["updated_at", "2014-11-13 13:44:23.213007"]]

    def set_discipline
      @discipline = Discipline.find(params[:id])
---
SELECT  "disciplines".* FROM "disciplines"  WHERE "disciplines"."id" = ? LIMIT 1  [["id", 1]]