app/controllers/graphics_controller.rb

SELECT "graphics".* FROM "graphics"
---
  def index
    @graphics = Graphic.all