app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules"
---
  def index
    @schedules = Schedule.all