app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "description", "first_name", "is_admin", "is_operator", "last_name", "salt", "second_name", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "crypted_password" = ?, "is_admin" = ?, "salt" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["crypted_password", "$2a$10$hD.PGyh7Y3BmSv4CepSTqOru.gvysxhUgDJ.j1DFaI1amBvjs/heG"], ["is_admin", "f"], ["salt", "zmXq8wim4juyyFLkHnmp"], ["updated_at", "2014-12-08 12:26:53.293632"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)